Catalogs/ТоварыПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ТоварыПрисоединенныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилища</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстХранилища</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ПрисоединенныеФайлы/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВладелецФайла = Параметры.ВладелецФайла;
	
	Список.Параметры.УстановитьЗначениеПараметра("ВладелецФайлов", ВладелецФайла);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВЫбораФайла.Открытие);
	ВыборФайла.МножественныйВыбор = Ложь;
	
	Если НЕ ВыборФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйФайл = ВыборФайла.ВыбранныеФайлы[0];
	Файл = Новый Файл(ВыбранныйФайл);
	
	ПомещаемыеФайлы = Новый Массив;
	Описание = Новый ОписаниеПередаваемогоФайла(Файл.ПолноеИмя, "");
	ПомещаемыеФайлы.Добавить(Описание);
	
	ПомещенныеФайлы = Новый Массив;
	ИдентификаторФормы = УникальныйИдентификатор;
	Если НЕ ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, , Ложь, ИдентификаторФормы) Тогда
		Сообщить("Ошибка при помещении файла во врем. хранилище!");
		Возврат;
	КонецЕсли;
	
	АдресВременногоХранилищаФайла = ПомещенныеФайлы[0].Хранение;
	
	РасширениеБезТочки = ?(Сред(Файл.Расширение, 1, 1) = ".", Сред(Файл.Расширение, 2), Файл.Расширение);
	
	ПараметрыФайла = Новый Структура("ИмяБезРасширения, ПутьКФайлу, Расширение", Файл.ИмяБезРасширения, Файл.ПолноеИмя, РасширениеБезТочки);
	
	ПрисоединенныйФайл = ДобавитьПрисоединенныйФайл(Параметры.ВладелецФайла, АдресВременногоХранилищаФайла, ПараметрыФайла)
	
КонецПроцедуры

&НаСервере
Функция ДобавитьПрисоединенныйФайл(ВладелецФайла, АдресВременногоХранилищаФайла, ПараметрыФайла)
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаФайла);
	
	ПрисоединенныйФайл = Справочники.ТоварыПрисоединенныеФайлы.СоздатьЭлемент();
	ПрисоединенныйФайл.ВладелецФайла = ВладелецФайла;
	ПрисоединенныйФайл.Наименование = ПараметрыФайла.ИмяБезРасширения;
	ПрисоединенныйФайл.ПутьКФайлу = ПараметрыФайла.ПутьКФайлу;
	//ПрисоединенныйФайл.ФайлХранилища = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	//ПрисоединенныйФайл.ФайлХранилища = Новый ХранилищеЗначения(ДвоичныеДанные);
	ПрисоединенныйФайл.ФайлХранилища = Новый ХранилищеЗначения(Новый Картинка(ДвоичныеДанные));
	ПрисоединенныйФайл.Расширение = ПараметрыФайла.Расширение;
	
	ПрисоединенныйФайл.Записать();
	
	СсылкаНаФайл = ПрисоединенныйФайл.Ссылка;
	
	Элементы.Список.ТекущаяСтрока = СсылкаНаФайл;
КонецФункции


&НаКлиенте
Процедура Добавить(Команда)
	Элементы.Список.ДобавитьСтроку();
КонецПроцедуры


&НаКлиенте
Процедура Просмотреть(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ДанныеФайла = ПолучитьДанныеФайла(ТекущиеДанные.Ссылка, УникальныйИдентификатор);
	
	ПолноеИмяФайлаНаКлиенте = ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);
	ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайлаНаКлиенте, ДанныеФайла.СсылкаНаДвоичныеДанныеФайлы);
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
	ПолученнныеФайлы = Новый Массив;
	
	Если ПолучитьФайлы(ПолучаемыеФайлы, ПолученнныеФайлы, , Ложь) Тогда	
		//ФайлНаДиске = Новый Файл(ПолноеИмяФайлаНаКлиенте);
		ЗапуститьПриложение(ПолноеИмяФайлаНаКлиенте);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеФайла(ПрисоединенныйФайл, УникальныйИдентификатор)
	ФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
	
	ДвоичныеДанные = ФайлОбъект.ФайлХранилища.Получить();
	СсылкаНаДвоичныеДанныеФайлы = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	Результат = Новый Структура;
	Результат.Вставить("СсылкаНаДвоичныеДанныеФайлы", СсылкаНаДвоичныеДанныеФайлы);
	Результат.Вставить("Наименование", ФайлОбъект.Наименование);
	Результат.Вставить("ПутьКФайлу", ФайлОбъект.ПутьКФайлу);
	Результат.Вставить("Расширение", ФайлОбъект.Расширение);
	
	Возврат Результат;
КонецФункции
